ADVERBS = [
    "продолжительно",
    "непродолжительно",
    "долго",
    "длительно",
    "подолгу",
]


SINGLE_REPETITION = [
    "ежегодно",
    "ежемесячно",
    "еженедельно",
    "ежедневно",
    "ежечасно",
    "ежеминутно",
    "ежесекундно",
]


REPETITION = ["каждый"]


TIME_PERIODS = [
    "год",
    "месяц",
    "неделя",
    "день",
    "час",
    "минута",
    "секунда",
    "январь",
    "февраль",
    "март",
    "апрель",
    "март",
    "май",
    "июнь",
    "июль",
    "полгода",
    "август",
    "сентябрь",
    "октябрь",
    "ноябрь",
    "декабрь",
    "раз",
]
