CONJUGATION_ENDINGS = {
    "ем": "им",
    "им": "ем",
    "ешь": "ишь",
    "ишь": "ешь",
    "ете": "ите",
    "ите": "ете",
    "ет": "ит",
    "ит": "ет",
    "ут": "ат",
    "ат": "ут",
    "ят": "ют",
    "ют": "ят",
}


DECLENSION = {
    "Sing": {
        "Gen": {
            "и": ["а", "я"],
            "ы": ["а", "я"],
            "а": ["и", "ы"],
            "я": ["и", "ы"],
        },
        "Dat": {
            "е": ["у", "ю", "и"],
            "у": ["е", "и"],
            "ю": ["е", "и"],
            "и": ["у", "ю", "е"],
        },
        "Acc": {
            "у": ["я"],
            "ю": ["я"],
            "я": ["у", "ю"],
        },
        "Ins": {
            "ой": ["ом", "ем", "ю"],
            "ей": ["ом", "ем", "ю"],
            "ом": ["ой", "ей", "ю"],
            "ем": ["ой", "ей", "ю"],
            "ю": ["ом", "ем", "ой", "ей"],
        },
        "Loc": {
            "е": ["и"],
            "и": ["е"],
        },
    },
    "Plur": {
        "Nom": {
            "ы": ["а"],
            "а": ["ы"],
        },
        "Acc": {
            "ы": ["а"],
            "а": ["ы"],
            "и": ["а"],
        },
    },
}
