ADP_CASES = {
    "согласно": ("gent", "datv"),
    "меж": ("gent", "ablt"),
    "между": ("gent", "ablt"),
    "промеж": ("gent", "ablt"),
    "промежду": ("gent", "ablt"),
    "благодаря": ("accs", "datv"),
    "за": ("accs", "ablt"),
    "под": ("accs", "ablt"),
    "подо": ("accs", "ablt"),
    "во": ("accs", "loct"),
    "в": ("accs", "loct"),
    "на": ("accs", "loct"),
    "об": ("accs", "loct"),
    "обо": ("accs", "loct"),
    "с": ("gent", "accs", "ablt"),
    "со": ("gent", "accs", "ablt"),
    "по": ("datv", "accs", "loct"),
}


WH_STOP = [
    "кто",
    "что",
    "чего",
    "сколько",
    "где",
    "какой",
    "каков",
    "когда",
    "почему",
    "чем",
    "чего",
    "куда",
    "который",
    "кому",
    "зачем",
    "откуда",
    "чей",
    "чья",
    "отчего",
]


MODAL_VERBS = [
    "нужно",
    "надо",
    "хочу",
    "могу",
    "можно",
    "должен",
]
